<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","backend":"a0e871dee60185da733e0fb7b347705b15937decece06dafafb4b1a895ba160d","plan_job_ref":"Job Create Terraform plan on Pull Request #11 at https://github.com/markwcodes/personal-website-infra/actions/runs/6857162098","plan_hash":"2d3a07926f6c1f84ad75eb20555d413e378d06703764b205e54e8dad2bc949f6","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __terraform__ in the __staging__ workspace
With var files: `terraform/terraform.tfvars
`<details open><summary>With variables</summary>

```hcl
app_key  = (sensitive value)
do_token = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_config_map.app_config_map will be created
  + resource "kubernetes_config_map" "app_config_map" {
      + data = {
          + "APP_ENV"        = "production"
          + "APP_NAME"       = "Personal website"
          + "ASSET_URL"      = "https://staging.wilson.codes"
          + "SESSION_DRIVER" = "file"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "app-config"
          + namespace        = "staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.app_namespace will be created
  + resource "kubernetes_namespace" "app_namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + annotations      = {
              + "name" = "staging"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app" = "markwcodes"
            }
          + name             = "staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.app_secrets will be created
  + resource "kubernetes_secret" "app_secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "app-secrets"
          + namespace        = "staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply Terraform plan from Pull Request #3](https://github.com/markwcodes/personal-website-infra/actions/runs/6857169590)